In [1]:
import pandas as pd
from operator import add
from functools import reduce
codeing={'subject':['python','java'],'amount':[1000,2000]}
df=pd.DataFrame(codeing)
print(df)

  subject  amount
0  python    1000
1    java    2000

In [ ]:
import pandas as pd
codeing={'subject':['python','java'],'amount':[1000,2000]}
df=pd.DataFrame(codeing)
print(df)

In [3]:
df['amount']=df['amount'].map(lambda x:x*2)
print(df)

  subject  amount
0  python    2000
1    java    4000

In [6]:
df2=df.filter(items=['subject'])
print(df2)
reduce(add,df.amount)

  subject
0  python
1    java

6000

In [44]:
import pandas as pd
df=pd.DataFrame([[9,4,8,9,],
                 [8,10,7,6],
                 [7,6,8,5]])
column=['maths','english','history','science']
print(df)
df.agg(['sum','min','max','std','count','size'])

   0   1  2  3
0  9   4  8  9
1  8  10  7  6
2  7   6  8  5

          0         1         2          3
sum    24.0  20.00000  23.00000  20.000000
min     7.0   4.00000   7.00000   5.000000
max     9.0  10.00000   8.00000   9.000000
std     1.0   3.05505   0.57735   2.081666
count   3.0   3.00000   3.00000   3.000000
size    3.0   3.00000   3.00000   3.000000

In [36]:
import pandas as pd
technologies={
          'courses':["python","DBMS","JAVA","python","spark"],
          'fee':[20000,25000,26000,22000,24000],
          'duration':["30days","40days","35days","60days","30days"],
          'discount':[10000,2300,1200,2500,2000]}
df=pd.DataFrame(technologies)
print(df)

  courses    fee duration  discount
0  python  20000   30days     10000
1    DBMS  25000   40days      2300
2    JAVA  26000   35days      1200
3  python  22000   60days      2500
4   spark  24000   30days      2000

In [37]:
df.groupby('courses').aggregate({'fee':'count'})

         fee
courses
DBMS       1
JAVA       1
python     2
spark      1

In [40]:
df.groupby('courses').agg({'duration':'count','fee':['first','last']})

        duration    fee
           count  first   last
courses
DBMS           1  25000  25000
JAVA           1  26000  26000
python         2  20000  22000
spark          1  24000  24000